import random

cards = {
    # SIN
    "sin 0°": "0",
    "sin 30°": "1/2",
    "sin 45°": "√2/2",
    "sin 60°": "√3/2",
    "sin 90°": "1",

    # COS
    "cos 0°": "1",
    "cos 30°": "√3/2",
    "cos 45°": "√2/2",
    "cos 60°": "1/2",
    "cos 90°": "0",

    # TG
    "tg 0°": "0",
    "tg 30°": "1/√3",
    "tg 45°": "1",
    "tg 60°": "√3",
    "tg 90°": "не существует",

    # CTG
    "ctg 0°": "не существует",
    "ctg 30°": "√3",
    "ctg 45°": "1",
    "ctg 60°": "1/√3",
    "ctg 90°": "0",
}

mult_nums = [0, 17, 18, 19, 21]

while True:
    q, a = random.choice(list(cards.items()))
    input(f"{q} =")
    print(f"👉 {a}\n")
